# Introducción a Pandas y DataFrames

## Importando Pandas

In [3]:
import pandas as pd

## Series en Pandas
### Crear una Serie

In [4]:
data = [10, 20, 30, 40]
series = pd.Series(data)
print("Serie:")
print(series)

Serie:
0    10
1    20
2    30
3    40
dtype: int64

In [5]:
type(data)

list

In [4]:
type(series)

pandas.core.series.Series

### Acceso a elementos de una Serie

In [6]:
print("Elemento en la posición 2:", series[2])

Elemento en la posición 2: 30

In [7]:
display(series)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
print("Elemento en la posición 2:", series[3])

Elemento en la posición 2: 40

### Ejercicio Práctico (Series):
1. Crea una Serie que contenga los nombres de 5 estudiantes.
2. Accede al tercer estudiante usando su índice.

In [10]:
est=['Jostin','Jennifer', 'Washington','Walter', 'Joseph']

s_est=pd.Series(est)

display(s_est)

0        Jostin
1      Jennifer
2    Washington
3        Walter
4        Joseph
dtype: object

## DataFrames en Pandas
### Crear un DataFrame

In [14]:
data = {
    'Nombre': ['Juan', 'Ana', 'Luis'],
    'Edad': [23, 21, 25],
    'Ciudad': ['Quito', 'Guayaquil', 'Cuenca']
}

df = pd.DataFrame(data)
print("DataFrame:")
display(df)

DataFrame:

  Nombre  Edad     Ciudad
0   Juan    23      Quito
1    Ana    21  Guayaquil
2   Luis    25     Cuenca

In [12]:
type(data)

dict

In [13]:
type(df)

pandas.core.frame.DataFrame

### Acceso a columnas

In [17]:
# Acceso por índice posicional
print("Primera fila usando iloc:")
print(df.iloc[0:2])

Primera fila usando iloc:
  Nombre  Edad     Ciudad
0   Juan    23      Quito
1    Ana    21  Guayaquil

In [18]:
# Acceso por etiqueta (si el índice es nombrado)
print("Fila con etiqueta 'a' usando loc (modifica el índice para probar):")

Fila con etiqueta 'a' usando loc (modifica el índice para probar):

In [19]:
display(df)

  Nombre  Edad     Ciudad
0   Juan    23      Quito
1    Ana    21  Guayaquil
2   Luis    25     Cuenca

In [22]:
df.index=['a','b','c']
display(df)

  Nombre  Edad     Ciudad
a   Juan    23      Quito
b    Ana    21  Guayaquil
c   Luis    25     Cuenca

In [26]:
df.loc['a':'b']

  Nombre  Edad     Ciudad
a   Juan    23      Quito
b    Ana    21  Guayaquil

### Ejercicio Práctico (DataFrames):
1. Crea un DataFrame con información ficticia de productos: nombre, precio y cantidad.
2. Filtra los productos con un precio mayor a 50.
3. Ordena el DataFrame por cantidad en orden descendente.

In [31]:

productos = {
    "producto1": {"nombre": "Laptop", "precio": 1200.99, "cantidad": 15},
    "producto2": {"nombre": "Smartphone", "precio": 799.49, "cantidad": 30},
    "producto3": {"nombre": "Auriculares", "precio": 49.99, "cantidad": 100},
    "producto4": {"nombre": "Monitor", "precio": 199.99, "cantidad": 25},
    "producto5": {"nombre": "Teclado", "precio": 29.99, "cantidad": 50},
    "producto6": {"nombre": "Ratón", "precio": 19.99, "cantidad": 60},
    "producto7": {"nombre": "Tablet", "precio": 299.99, "cantidad": 20},
    "producto8": {"nombre": "Cámara", "precio": 499.99, "cantidad": 10},
    "producto9": {"nombre": "Impresora", "precio": 89.99, "cantidad": 12},
    "producto10": {"nombre": "Altavoces", "precio": 99.99, "cantidad": 40},
}

In [33]:
store = pd.DataFrame.from_dict(productos, orient="index")
display(store)

                 nombre   precio  cantidad
producto1        Laptop  1200.99        15
producto2    Smartphone   799.49        30
producto3   Auriculares    49.99       100
producto4       Monitor   199.99        25
producto5       Teclado    29.99        50
producto6         Ratón    19.99        60
producto7        Tablet   299.99        20
producto8        Cámara   499.99        10
producto9     Impresora    89.99        12
producto10    Altavoces    99.99        40

In [36]:
store.index=[0,1,2,3,4,5,6,8,9,10]
display(store)

         nombre   precio  cantidad
0        Laptop  1200.99        15
1    Smartphone   799.49        30
2   Auriculares    49.99       100
3       Monitor   199.99        25
4       Teclado    29.99        50
5         Ratón    19.99        60
6        Tablet   299.99        20
8        Cámara   499.99        10
9     Impresora    89.99        12
10    Altavoces    99.99        40

In [38]:
store[store['cantidad']>=50]

        nombre  precio  cantidad
2  Auriculares   49.99       100
4      Teclado   29.99        50
5        Ratón   19.99        60

In [39]:
store_ord=store.copy()

In [41]:
store_ord = store.sort_values(by="precio", ascending=True)
display(store_ord)

         nombre   precio  cantidad
5         Ratón    19.99        60
4       Teclado    29.99        50
2   Auriculares    49.99       100
9     Impresora    89.99        12
10    Altavoces    99.99        40
3       Monitor   199.99        25
6        Tablet   299.99        20
8        Cámara   499.99        10
1    Smartphone   799.49        30
0        Laptop  1200.99        15

In [42]:
store_ord.iloc[0]

nombre      Ratón
precio      19.99
cantidad       60
Name: 5, dtype: object

## Operaciones Básicas con DataFrames
### Añadir una nueva columna

In [43]:
display(df)

  Nombre  Edad     Ciudad
a   Juan    23      Quito
b    Ana    21  Guayaquil
c   Luis    25     Cuenca

In [44]:
df['Saludo'] = 'Hola ' + df['Nombre']
print("DataFrame con nueva columna:")
display(df)

DataFrame con nueva columna:

  Nombre  Edad     Ciudad     Saludo
a   Juan    23      Quito  Hola Juan
b    Ana    21  Guayaquil   Hola Ana
c   Luis    25     Cuenca  Hola Luis

### Filtrado de filas

In [45]:
# Filtrar personas mayores de 22 años
print("Filtrar filas donde Edad > 22:")
print(df[df['Edad'] > 22])

Filtrar filas donde Edad > 22:
  Nombre  Edad  Ciudad     Saludo
a   Juan    23   Quito  Hola Juan
c   Luis    25  Cuenca  Hola Luis

### Estadísticas descriptivas

In [46]:
print("Resumen estadístico:")
print(df.describe())

Resumen estadístico:
       Edad
count   3.0
mean   23.0
std     2.0
min    21.0
25%    22.0
50%    23.0
75%    24.0
max    25.0

### Ejercicio Práctico (Operaciones):
1. Agrega una nueva columna a un DataFrame que calcule un descuento de 10% sobre un precio inicial.
2. Filtra las filas donde la cantidad sea mayor que 10.
3. Calcula la media de los precios en el DataFrame.

In [47]:
display(store)

         nombre   precio  cantidad
0        Laptop  1200.99        15
1    Smartphone   799.49        30
2   Auriculares    49.99       100
3       Monitor   199.99        25
4       Teclado    29.99        50
5         Ratón    19.99        60
6        Tablet   299.99        20
8        Cámara   499.99        10
9     Impresora    89.99        12
10    Altavoces    99.99        40


## Selección y Acceso Avanzado
### Selección con condiciones

In [ ]:
print("Selección condicional:")
print(df[(df['Edad'] > 22) & (df['Ciudad'] == 'Quito')])

### Acceso por índices y etiquetas

In [ ]:
# Seleccionar una celda específica
print("Acceso a celda específica (iloc[0, 1]):")
print(df.iloc[0, 1])  # Fila 0, columna 1

### Ejercicio Práctico (Selección):
1. Crea un DataFrame que represente las ventas de una tienda con columnas: producto, ventas, y ganancias.
2. Filtra los productos con ganancias mayores a 500.
3. Selecciona las primeras 2 filas y las columnas "producto" y "ventas".

## Guardar y Cargar Datos
### Guardar un DataFrame en un archivo CSV

In [ ]:
df.to_csv('dataframe.csv', index=False)
print("DataFrame guardado como 'dataframe.csv'")

### Cargar un DataFrame desde un archivo CSV

In [ ]:
df_loaded = pd.read_csv('dataframe.csv')
print("DataFrame cargado desde 'dataframe.csv':")
print(df_loaded)

### Ejercicio Práctico (Guardar y Cargar):
1. Guarda un DataFrame con datos ficticios en un archivo CSV.
2. Carga el archivo y muestra su contenido.